sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.c
/*!
    \file    gd32a7xx_sent.c
    \brief   SENT driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

/*!
    \page    misra_violations MISRA-C:2012 violations

    \section [MISRA-C:2012]
             violates MISRA C:2012 Rule-10.8 (Required) The value of a composite expression
             shall not be cast to a different essential type category or a wider essential type
*/

#include "gd32a7xx_sent.h"

#define SENT_INIT_MASK                          ((uint32_t)0xFFFFFDFFU)  /*!< SENT parameter initialization mask */
#define SENT_DFTTH_OFFSET                       ((uint32_t)0x00000004U)  /*!< SENT channel filter threshold offset */
#define SENT_DATANIBBLE1_POSITION_OFFSET        ((uint32_t)0x00000004U)  /*!< SENT data nibble position 1 offset */
#define SENT_DATANIBBLE2_POSITION_OFFSET        ((uint32_t)0x00000008U)  /*!< SENT data nibble position 2 offset */
#define SENT_DATANIBBLE3_POSITION_OFFSET        ((uint32_t)0x0000000CU)  /*!< SENT data nibble position 3 offset */
#define SENT_DATANIBBLE4_POSITION_OFFSET        ((uint32_t)0x00000010U)  /*!< SENT data nibble position 4 offset */
#define SENT_DATANIBBLE5_POSITION_OFFSET        ((uint32_t)0x00000014U)  /*!< SENT data nibble position 5 offset */
#define SENT_DATANIBBLE6_POSITION_OFFSET        ((uint32_t)0x00000018U)  /*!< SENT data nibble position 6 offset */
#define SENT_DATANIBBLE7_POSITION_OFFSET        ((uint32_t)0x0000001CU)  /*!< SENT data nibble position 7 offset */
#define SENT_STATCOM_OFFSET                     ((uint32_t)0x00000008U)  /*!< SENT status & communication nibble offset */
#define SENT_MSGID_OFFSET                       ((uint32_t)0x00000010U)  /*!< SENT message id offset */
#define SENT_ESDT_OFFSET                        ((uint32_t)0x0000001FU)  /*!< SENT enhanced message type offset */
#define SENT_SDCRC_OFFSET                       ((uint32_t)0x00000018U)  /*!< SENT serial data crc offset */
#define SENT_EGDE_COUNT_OFFSET                  ((uint32_t)0x00000014U)  /*!< SENT egde count offset */
#define SENT_FDIV_DIVMOD_OFFSET                 ((uint32_t)0x0000000EU)  /*!< SENT fractional divider mode offset */
#define SENT_TICK_FACTOR                        ((double)56)             /*!< SENT tick clock factor */

/* get SENT module clock */
static double sent_get_module_clock(void);
/* get SENT channel clock */
static double sent_get_channel_clock(sent_channel_enum channelx);

/*!
    \brief      reset SENT (API_ID: 0x0001U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sent_deinit(void)
{
    /* disable SENT */
    sent_disable();
    /* reset SENT */
    rcu_periph_reset_enable(RCU_SENTRST);
    rcu_periph_reset_disable(RCU_SENTRST);
}

/*!
    \brief      initialize the parameters of SENT struct with default values (API_ID: 0x0002U)
    \param[in]  none
    \param[out] sent_struct: the initialized structure sent_parameter_struct pointer
    \retval     none
*/
void sent_struct_para_init(sent_parameter_struct *sent_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(sent_struct)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the structure with default values */
        sent_struct->freq_drift_check          = SENT_FREQ_DRIFT_CHECK_DISABLE;
        sent_struct->freq_drift_error_mode     = SENT_FREQ_DRIFT_ERROR_DISABLE;
        sent_struct->serial_message_mode       = SENT_SHORT_SERIAL_MESSAGE;
        sent_struct->serial_message_crc_mode   = SENT_SERIAL_MESSAGE_NORMAL_CRC;
        sent_struct->data_length               = SENT_DATALEN_6_NIBBLE;
        sent_struct->cons_sync_check_mode      = SENT_CONS_SYNC_CHECK_AFTER;
        sent_struct->crc                       = SENT_CRC_ENABLE;
        sent_struct->serial_data_crc           = SENT_SERIAL_DATA_CRC_ENABLE;
        sent_struct->serial_data_parse         = SENT_SERIAL_DATA_HARDWARE_PARSE;
        sent_struct->status_nibble_in_crc      = SENT_STATUS_NIBBLE_NOT_IN_CRC;
        sent_struct->alter_crc_mode            = SENT_STANDARD_CRC;
        sent_struct->ignore_pause              = SENT_IGNORE_PAUSE;
        sent_struct->pulse_polarity            = SENT_PULSE_POLARITY_LOW;
    }
}

/*!
    \brief      initialize SENT parameter  (API_ID: 0x0003U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  sent_struct: SENT parameter initialization stuct members of the structure
                            and the member values are shown as below:
                  freq_drift_check       : SENT_FREQ_DRIFT_CHECK_ENABLE, SENT_FREQ_DRIFT_CHECK_DISABLE
                  freq_drift_error_mode  : SENT_FREQ_DRIFT_ERROR_ENABLE, SENT_FREQ_DRIFT_ERROR_DISABLE
                  serial_message_mode    : SENT_SHORT_SERIAL_MESSAGE, SENT_ENHANCED_SERIAL_MESSAGE
                  serial_message_crc_mode: SENT_SERIAL_MESSAGE_AUGMENTATION_CRC, SENT_SERIAL_MESSAGE_NORMAL_CRC
                  data_length            : SENT_DATALEN_x_NIBBLE (x = 0...7)
                  cons_sync_check_mode   : SENT_CONS_SYNC_CHECK_AFTER, SENT_CONS_SYNC_CHECK_BEFORE
                  crc                    : SENT_CRC_ENABLE, SENT_CRC_DISABLE
                  serial_data_crc        : SENT_SERIAL_DATA_CRC_ENABLE, SENT_SERIAL_DATA_CRC_DISABLE
                  serial_data_parse      : SENT_SERIAL_DATA_HARDWARE_PARSE, SENT_SERIAL_DATA_SOFTWARE_PARSE
                  status_nibble_in_crc   : SENT_STATUS_NIBBLE_IN_CRC, SENT_STATUS_NIBBLE_NOT_IN_CRC
                  alter_crc_mode         : SENT_PARALLEL_CRC, SENT_STANDARD_CRC
                  ignore_pause           : SENT_IGNORE_PAUSE, SENT_NOT_IGNORE_PAUSE
                  pulse_polarity         : SENT_PULSE_POLARITY_HIGH, SENT_PULSE_POLARITY_LOW
    \param[out] none
    \retval     none
*/
void sent_init(sent_channel_enum channelx, sent_parameter_struct *sent_struct)
{
    uint32_t reg1;
    uint32_t reg2;

