sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(sent_struct)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else if(NOT_SENT_FREQ_DRIFT_CHECK(sent_struct ->freq_drift_check)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_FREQ_DRIFT_ERROR(sent_struct ->freq_drift_error_mode)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_SERIAL_MSG_MODE(sent_struct ->serial_message_mode)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_SERIAL_MSG_CRC_MODE(sent_struct ->serial_message_crc_mode)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_DATA_LENGTH(sent_struct ->data_length)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_CONS_SYNC_CHECK(sent_struct ->cons_sync_check_mode)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_CRC(sent_struct ->crc)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_SERIAL_DATA_CRC(sent_struct ->serial_data_crc)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_SERIAL_DATA_PARSE(sent_struct ->serial_data_parse)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_STATUS_NIBBLE_IN_CRC(sent_struct ->status_nibble_in_crc)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_ALTER_CRC(sent_struct ->alter_crc_mode)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_IGNORE_PAUSE(sent_struct ->ignore_pause)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SENT_PULSE_POLARITY(sent_struct ->pulse_polarity)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure receiver control parameters */
        reg1 = sent_struct->freq_drift_check | sent_struct->freq_drift_error_mode | sent_struct->serial_message_mode \
               | sent_struct->serial_message_crc_mode | sent_struct->data_length | sent_struct->cons_sync_check_mode \
               | sent_struct->crc | sent_struct->serial_data_crc | sent_struct->serial_data_parse | sent_struct->status_nibble_in_crc \
               | sent_struct->alter_crc_mode | sent_struct->ignore_pause;
            
        reg2 = SENT_CHCS((uint32_t)channelx);
        reg2 &= SENT_INIT_MASK;
        /* configure pulse polarity */
        reg2 |= sent_struct->pulse_polarity;

        /* write to registers */
        SENT_CHRCTL((uint32_t)channelx) = (uint32_t)reg1;
        SENT_CHCS((uint32_t)channelx) = (uint32_t)reg2;
    }
}

/*!
    \brief      enable SENT (API_ID: 0x0004U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sent_enable(void)
{
    SENT_CS |= SENT_CS_SENTEN;
}

/*!
    \brief      disable SENT (API_ID: 0x0005U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sent_disable(void)
{
    SENT_CS &= ~(SENT_CS_SENTEN);
}

/*!
    \brief      enable SENT sleep mode (API_ID: 0x0006U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sent_sleep_enable(void)
{
    SENT_CS |= SENT_CS_SLPEN;
}

/*!
    \brief      disable SENT sleep mode (API_ID: 0x0007U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sent_sleep_disable(void)
{
    SENT_CS &= ~(SENT_CS_SLPEN);
}

/*!
    \brief      get SENT state (API_ID: 0x0008U)
    \param[in]  none
    \param[out] none
    \retval     ControlStatus: ENABLE or DISABLE
*/
ControlStatus sent_state_get(void)
{
    ControlStatus  status;

    if((uint32_t)RESET != (SENT_CS & SENT_CS_SENTF)){
        status = ENABLE;
    }else{
        status = DISABLE;
    }
    return status;
}

/*!
    \brief      enable SENT channel x (API_ID: 0x0009U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     none
*/
void sent_channel_enable(sent_channel_enum channelx)
{
    SENT_CHRCTL((uint32_t)channelx) |= SENT_CHXRCTL_CHEN;
}

/*!
    \brief      disable SENT channel x (API_ID: 0x000AU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     none
*/
void sent_channel_disable(sent_channel_enum channelx)
{
    SENT_CHRCTL((uint32_t)channelx) &= ~(SENT_CHXRCTL_CHEN);
}

/*!
    \brief      get SENT channel state (API_ID: 0x000BU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     state of SENT channel x
      \arg        SENT_CH_STOP: channel is disabled
      \arg        SENT_CH_INIT: channel is enabled, but synchronization/calibration pulse  has not been received
      \arg        SENT_CH_RUN : channel is enabled and the synchronization/calibration pulse received was out of the correct frequency range or had frequency drift and was out of range
      \arg        SENT_CH_SYNC: Channel is enabled and synchronization/calibration pulse received is valid and in the synchronization state
*/
uint32_t sent_channel_state_get(sent_channel_enum channelx)
{
    uint32_t state;

    state = SENT_CHRSTAT((uint32_t)channelx) & SENT_CHXRSTAT_CHSTAT;

    return state;
}

/*!
    \brief      select SENT channel x input (API_ID: 0x000CU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  inputx: SENT channel input x (x = 0...3)
                only one parameter can be selected which is shown as below:
      \arg        SENT_ALTI_INPUT0: SENT channel input 0
      \arg        SENT_ALTI_INPUT1: SENT channel input 1
      \arg        SENT_ALTI_INPUT2: SENT channel input 2
      \arg        SENT_ALTI_INPUT3: SENT channel input 3
    \param[out] none
    \retval     none
*/
void sent_channel_input_select(sent_channel_enum channelx, sent_channel_input_enum inputx)
{
    uint32_t reg = SENT_CHCS((uint32_t)channelx);

    reg &=~SENT_CHXCS_INSEL;
    reg |= (uint32_t)inputx;
    SENT_CHCS((uint32_t)channelx) = reg;
}

/*!
    \brief      configure SENT module clock (API_ID: 0x000DU)
    \param[in]  dividermode: divider mode
                only one parameter can be selected which is shown as below:
      \arg        SENT_CLOCKDIVIDERMODE_OFF: disable fractional divider, no output clock is generated
      \arg        SENT_CLOCKDIVIDERMODE_NORMAL: normal divider mode
      \arg        SENT_CLOCKDIVIDERMODE_FRACTIONAL: fractional divider mode
    \param[in]  stepvalue: 0...0x3FF
    \param[out] none
    \retval     none
*/
void sent_module_clock_config(uint32_t dividermode, uint32_t stepvalue)
{
    uint32_t reg = SENT_FDIV;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_CLOCK_DIVIDER_MODE(dividermode)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else if(NOT_SENT_CLOCK_STEP(stepvalue)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure divider mode */
        reg &= ~(SENT_FDIV_DIVMOD);
        reg |= (dividermode << SENT_FDIV_DIVMOD_OFFSET);
        /* configure stepvalue */
        reg &= ~(SENT_FDIV_STEP);
        reg |= (SENT_FDIV_STEP & stepvalue);
        
        SENT_FDIV = reg;
    }
}

/*!
    \brief      configure SENT ticks clock (API_ID: 0x000EU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  tick_unit: 0.00000004 ~ 0.001024
    \param[out] none
    \retval     none
*/
void sent_channel_tick_clock_config(sent_channel_enum channelx, double tick_unit)
{
    double         fracdiv;
    uint32_t       psc = 0U;
    uint32_t       div = 0U;
    double         result;
    uint32_t       div_max;
    uint32_t       reg;

