sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_CHANNEL_TICK(tick_unit)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x000EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get fracdiv */
        fracdiv = sent_get_module_clock();
        result  = fracdiv * SENT_TICK_FACTOR * tick_unit;
        for (div_max = 2200U; div_max < 49100U ; div_max++){
            psc = (uint32_t)(result / (double)div_max);
            div = (uint32_t)(result / (double)psc);

            /* count psc and div value */
            if ((psc < 0x00001000U) && (psc > 0x00000000U)){
                break;
            } else {
                /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
            }
        }

        /* configure psc */
        reg = SENT_CHPSC((uint32_t)channelx);
        reg &= ~(SENT_CHXPSC_PSC);
        reg |= (SENT_CHXPSC_PSC & (psc - 0x00000001U));
        SENT_CHPSC((uint32_t)channelx) = reg;
        
        /* configure div */
        reg =  SENT_CHFDIV((uint32_t)channelx);
        reg &= ~(SENT_CHXFDIV_DIV);
        reg |= (SENT_CHXFDIV_DIV & div);
        SENT_CHFDIV((uint32_t)channelx) = reg;
    }
}

/*!
    \brief      set SENT filter threshold (API_ID: 0x000FU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  threshold: 0...0xF
    \param[out] none
    \retval     none
*/
void sent_filter_threshold_set(sent_channel_enum channelx, uint32_t threshold)
{
    uint32_t reg = SENT_CHCS((uint32_t)channelx);
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_CHANNEL_FILTER_TH(threshold)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x000FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg &= ~(SENT_CHXCS_DFTTH);
        reg |= (threshold << SENT_DFTTH_OFFSET);
        SENT_CHCS((uint32_t)channelx) = reg;
    }
}

/*!
    \brief      configure the SENT channel data nibble storage position (API_ID: 0x0010U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  data: SENT nibble control parameter stuct members of the structure
                            and the member values are shown as below:
                  nibblex_position (x = 0...7): specifies the received nibblex control, refer to sent_nibble_position_enum
    \param[out] none
    \retval     none
*/
void sent_data_nibble_pos_config(sent_channel_enum channelx, sent_nibble_control_struct *data)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SENT_CHRDPCFG((uint32_t)channelx) = ((uint32_t)(data->nibble0_position) | ((uint32_t)(data->nibble1_position) << SENT_DATANIBBLE1_POSITION_OFFSET) | \
                                            ((uint32_t)(data->nibble2_position) << SENT_DATANIBBLE2_POSITION_OFFSET) | ((uint32_t)(data->nibble3_position) << SENT_DATANIBBLE3_POSITION_OFFSET) | \
                                            ((uint32_t)(data->nibble4_position) << SENT_DATANIBBLE4_POSITION_OFFSET) | ((uint32_t)(data->nibble5_position) << SENT_DATANIBBLE5_POSITION_OFFSET) | \
                                            ((uint32_t)(data->nibble6_position) << SENT_DATANIBBLE6_POSITION_OFFSET) | ((uint32_t)(data->nibble7_position) << SENT_DATANIBBLE7_POSITION_OFFSET));
    }
}

/*!
    \brief      configure the SENT timestamp prescaler (API_ID: 0x0011U)
    \param[in]  psc: timestamp prescaler, 0 ~ 0x000FFFFF
    \param[out] none
    \retval     none
*/
void sent_timestamp_prescaler_config(uint32_t psc)
{
    uint32_t reg = SENT_TSPSC;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_TIMESTAMP_PRESCALER(psc)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg &= ~(SENT_TSPSC_TSPSC);
        reg |= psc;
        SENT_TSPSC = reg;
    }
}

/*!
    \brief      get SENT current timestamp (API_ID: 0x0012U)
    \param[in]  none
    \param[out] none
    \retval     uint32_t: 0 ~ 0xFFFFFFFF
*/
uint32_t sent_timestamp_get(void)
{
    return (SENT_TS);
}

/*!
    \brief      set SENT watchdog threshold (API_ID: 0x0013U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  threshold: 0...0xFFFF
    \param[out] none
    \retval     none
*/
void sent_watchdog_threshold_set(sent_channel_enum channelx, uint16_t threshold)
{
    uint32_t reg = SENT_CHWDGT((uint32_t)channelx);

    reg &= ~(SENT_CHXWDGT_THOLD);
    reg |= threshold;
    SENT_CHWDGT((uint32_t)channelx) = reg;
}

/*!
    \brief      SENT receive data nibble (API_ID: 0x0014U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     uint32_t: 0 ~ 0xFFFFFFFF
*/
uint32_t sent_receive_data(sent_channel_enum channelx)
{
    return (SENT_CHRDATA((uint32_t)channelx));
}

/*!
    \brief      SENT receive frame (API_ID: 0x0015U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
      \param[out] frame: the structure sent_frame_struct pointer, point to the received frame
    \retval     none
*/
void sent_receive_frame(sent_channel_enum channelx, sent_frame_struct *frame)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(frame)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0015U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        frame->data         = SENT_CHRDATA((uint32_t)channelx) ;
        frame->timestamp    = SENT_CHTS((uint32_t)channelx);
        frame->statusnibble = (uint8_t)((SENT_CHRSTAT((uint32_t)channelx) & SENT_CHXRSTAT_STACOM) >> SENT_STATCOM_OFFSET);
        frame->crcnibble    = (uint8_t)(SENT_CHRSTAT((uint32_t)channelx) & SENT_CHXRSTAT_CRC);
    }
}

/*!
    \brief      SENT receive serial message (API_ID: 0x0016U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
      \param[out] message: the structure sent_serialmessage_frame_struct pointer, point to the received serial message
    \retval     none
*/
void sent_receive_serial_message(sent_channel_enum channelx, sent_serialmessage_frame_struct *message)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(message)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0016U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        message->serialdata = (uint16_t)(SENT_CHRSDSTAT((uint32_t)channelx) & SENT_CHXRSDSTAT_SDATA);
        message->messageid  = (uint8_t)((SENT_CHRSDSTAT((uint32_t)channelx) & SENT_CHXRSDSTAT_MSGID)>> SENT_MSGID_OFFSET);
        message->configbit  = (uint8_t)((SENT_CHRSDSTAT((uint32_t)channelx) & SENT_CHXRSDSTAT_ESDT)>>SENT_ESDT_OFFSET);
        message->crc        = (uint8_t)((SENT_CHRSDSTAT((uint32_t)channelx) & SENT_CHXRSDSTAT_SDCRC)>>SENT_SDCRC_OFFSET);
    }
}

/*!
    \brief      get the falling edge count occurring on the selected SENT input pin (API_ID: 0x0017U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     uint8_t: 0 ~ 0xFF
*/
uint8_t sent_input_edge_count_get(sent_channel_enum channelx)
{
    return (uint8_t)((SENT_CHCS((uint32_t)channelx) & SENT_CHXCS_EGCNT) >> SENT_EGDE_COUNT_OFFSET);
}

/*!
    \brief      clear the falling edge count occurring on the selected SENT input pin (API_ID: 0x0018U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     none
*/
void sent_input_edge_count_clear(sent_channel_enum channelx)
{
    SENT_CHCS((uint32_t)channelx) |= SENT_CHXCS_EGCNTC;
}

/*!
    \brief      get SENT frame length (API_ID: 0x0019U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     3.68E-5~1.120256
*/
double sent_get_frame_length(sent_channel_enum channelx)
{
    uint32_t reg;
    double length;
    double fpsc;

    /* get fpsc */
    fpsc = sent_get_channel_clock(channelx);
    /* get frame length */
    reg = GET_BITS(SENT_CHRSTAT((uint32_t)channelx), 16U, 31U);
    length = (double)((double)reg / fpsc);
    
