sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.c
    return length;
}

/*!
    \brief      get SENT synchronization pulse length (API_ID: 0x001AU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     2.24E-5~5.7344E-2
*/
double sent_get_sync_length(sent_channel_enum channelx)
{
    uint32_t reg;
    double length;
    double fpsc;
    
    /* get fpsc */
    fpsc = sent_get_channel_clock(channelx);
    /* get synchronization pulse length */
    reg = GET_BITS(SENT_CHFDIV((uint32_t)channelx), 16U, 31U);
    length = (double)((double)reg / fpsc);
    
    return length;
}

/*!
    \brief      set SENT channel flag status (API_ID: 0x001BU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  flag: SENT flag status
                only one parameter can be selected which is shown as below:
      \arg        SENT_FLAG_RSF     : receive success flag
      \arg        SENT_FLAG_RBNE    : receive buffer not empty flag
      \arg        SENT_FLAG_RXOVERR : receive buffer overflow error flag
      \arg        SENT_FLAG_FDEVERR : frequency deviation error flag
      \arg        SENT_FLAG_FDERR   : frequency drift error flag
      \arg        SENT_FLAG_NNIBERR : number of nibbles error flag
      \arg        SENT_FLAG_NIBVERR : nibble value error flag
      \arg        SENT_FLAG_CRCERR  : CRC error flag
      \arg        SENT_FLAG_SSDSTERR: short serial data message start bit error flag
      \arg        SENT_FLAG_SDRBNE  : serial data receive buffer not empty flag
      \arg        SENT_FLAG_SDCRCERR: serial data CRC error flag
      \arg        SENT_FLAG_WDERR   : watchdog error flag
    \param[out] none
    \retval     none
*/
void sent_channel_flag_set(sent_channel_enum channelx, sent_channel_flag_enum flag)
{
    SENT_CHSTATCTL((uint32_t)channelx) |= BIT(SENT_BIT_POS((uint32_t)flag));
}

/*!
    \brief      get SENT channel status (API_ID: 0x001CU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  flag: SENT flag status
                only one parameter can be selected which is shown as below:
      \arg        SENT_FLAG_RSF     : receive success flag
      \arg        SENT_FLAG_RBNE    : receive buffer not empty flag
      \arg        SENT_FLAG_RXOVERR : receive buffer overflow error flag
      \arg        SENT_FLAG_FDEVERR : frequency deviation error flag
      \arg        SENT_FLAG_FDERR   : frequency drift error flag
      \arg        SENT_FLAG_NNIBERR : number of nibbles error flag
      \arg        SENT_FLAG_NIBVERR : nibble value error flag
      \arg        SENT_FLAG_CRCERR  : CRC error flag
      \arg        SENT_FLAG_SSDSTERR: short serial data message start bit error flag
      \arg        SENT_FLAG_SDRBNE  : serial data receive buffer not empty flag
      \arg        SENT_FLAG_SDCRCERR: serial data CRC error flag
      \arg        SENT_FLAG_WDERR   : watchdog error flag
      \arg        SENT_FLAG_REGNDF  : rising edge noise detect flag
      \arg        SENT_FLAG_FEGNDF  : falling edge noise detect flag
      \arg        SENT_FLAG_RSL     : receive signal level
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus sent_channel_flag_get(sent_channel_enum channelx, sent_channel_flag_enum flag)
{
    FlagStatus  status;

    if(0U != ((SENT_REG_VAL((uint32_t)flag, (uint32_t)channelx)) & BIT(SENT_BIT_POS((uint32_t)flag)))) {
        status = SET;
    } else {
        status = RESET;
    }

    return status;
}

/*!
    \brief      clear SENT channel status (API_ID: 0x001DU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  flag: SENT flag status
                only one parameter can be selected which is shown as below:
      \arg        SENT_FLAG_RSFC     : receive success flag clear 
      \arg        SENT_FLAG_RBNEC    : receive buffer not empty flag clear
      \arg        SENT_FLAG_RXOVERRC : receive buffer overflow error flag clear
      \arg        SENT_FLAG_FDEVERRC : frequency deviation error flag clear
      \arg        SENT_FLAG_FDERRC   : frequency drift error flag clear
      \arg        SENT_FLAG_NNIBERRC : number of nibbles error flag clear
      \arg        SENT_FLAG_NIBVERRC : nibble value error flag clear
      \arg        SENT_FLAG_CRCERRC  : CRC error flag clear
      \arg        SENT_FLAG_SSDSTERRC: short serial data message start bit error flag clear
      \arg        SENT_FLAG_SDRBNEC  : serial data receive buffer not empty flag clear
      \arg        SENT_FLAG_SDCRCERRC: serial data CRC error flag clear
      \arg        SENT_FLAG_WDERRC   : watchdog error flag clear
      \arg        SENT_FLAG_REGNDFC  : rising edge noise detect flag clear
      \arg        SENT_FLAG_FEGNDFC  : falling edge noise detect flag clear
    \param[out] none
    \retval     none
*/
void sent_channel_flag_clear(sent_channel_enum channelx, sent_channel_flag_clear_enum flag)
{
    (SENT_REG_VAL((uint32_t)flag, (uint32_t)channelx)) = BIT(SENT_BIT_POS((uint32_t)flag));
}

/*!
    \brief      enable SENT  channel interrupt (API_ID: 0x001EU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  interrupt: SENT interrupt
                only one parameter can be selected which is shown as below:
      \arg        SENT_INT_RSF     : receive success interrupt enable
      \arg        SENT_INT_RBNE    : receive buffer not empty interrupt enable
      \arg        SENT_INT_RXOVERR : receive buffer overflow error interrupt enable
      \arg        SENT_INT_FDEVERR : frequency deviation error interrupt enable
      \arg        SENT_INT_FDERR   : frequency drift error interrupt enable
      \arg        SENT_INT_NNIBERR : number of nibbles error interrupt enable
      \arg        SENT_INT_NIBVERR : nibble value error interrupt enable
      \arg        SENT_INT_CRCERR  : CRC error interrupt enable
      \arg        SENT_INT_SSDSTERR: short serial data message start bit error interrupt enable
      \arg        SENT_INT_SDRBNE  : serial data receive buffer not empty interrupt enable
      \arg        SENT_INT_SDCRCERR: serial data CRC error interrupt enable
      \arg        SENT_INT_WDERR   : watchdog error interrupt enable
    \param[out] none
    \retval     none
*/
void sent_channel_interrupt_enable(sent_channel_enum channelx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_INTERRUPT(interrupt)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SENT_CHINTEN((uint32_t)channelx) |= interrupt;
    }
}
/*!
    \brief      disable SENT channel interrupt (API_ID: 0x001FU)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  interrupt: SENT interrupt
                only one parameter can be selected which is shown as below:
      \arg        SENT_INT_RSF     : receive success interrupt enable
      \arg        SENT_INT_RBNE    : receive buffer not empty interrupt enable
      \arg        SENT_INT_RXOVERR : receive buffer overflow error interrupt enable
      \arg        SENT_INT_FDEVERR : frequency deviation error interrupt enable
      \arg        SENT_INT_FDERR   : frequency drift error interrupt enable
      \arg        SENT_INT_NNIBERR : number of nibbles error interrupt enable
      \arg        SENT_INT_NIBVERR : nibble value error interrupt enable
      \arg        SENT_INT_CRCERR  : CRC error interrupt enable
      \arg        SENT_INT_SSDSTERR: short serial data message start bit error interrupt enable
      \arg        SENT_INT_SDRBNE  : serial data receive buffer not empty interrupt enable
      \arg        SENT_INT_SDCRCERR: serial data CRC error interrupt enable
      \arg        SENT_INT_WDERR   : watchdog error interrupt enable
    \param[out] none
    \retval     none
*/
void sent_channel_interrupt_disable(sent_channel_enum channelx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_INTERRUPT(interrupt)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x001FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SENT_CHINTEN((uint32_t)channelx) &= ~interrupt;
    }
}

/*!
    \brief      get SENT channel interrupt and flag status (API_ID: 0x0020U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  int_flag: interrupt and flag type
                only one parameter can be selected which is shown as below:
      \arg        SENT_INT_FLAG_RSF     : receive success interrupt flag
      \arg        SENT_INT_FLAG_RBNE    : receive buffer not empty interrupt flag
      \arg        SENT_INT_FLAG_RXOVERR : receive buffer overflow error interrupt flag
      \arg        SENT_INT_FLAG_FDEVERR : frequency deviation error interrupt flag
      \arg        SENT_INT_FLAG_FDERR   : frequency drift error interrupt flag
      \arg        SENT_INT_FLAG_NNIBERR : number of nibbles error interrupt flag
      \arg        SENT_INT_FLAG_NIBVERR : nibble value error interrupt flag
      \arg        SENT_INT_FLAG_CRCERR  : CRC error interrupt flag
      \arg        SENT_INT_FLAG_SSDSTERR: short serial data message start bit error interrupt flag
      \arg        SENT_INT_FLAG_SDRBNE  : serial data receive buffer not empty interrupt flag
      \arg        SENT_INT_FLAG_SDCRCERR: serial data CRC error interrupt flag
      \arg        SENT_INT_FLAG_WDERR   : watchdog error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus sent_channel_interrupt_flag_get(sent_channel_enum channelx, uint32_t int_flag)
{
    FlagStatus  status = RESET;
    uint32_t intenable, flagstatus;
    
