sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_INT_FLAG(int_flag)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the interrupt enable bit status */
        intenable = SENT_CHINTEN((uint32_t)channelx) & int_flag;
        /* get the corresponding flag bit status */
        flagstatus = SENT_CHSTAT((uint32_t)channelx) & int_flag;

        if(0U != (flagstatus & intenable)) {
            status = SET;
        } else {
            status = RESET;
        }
    }
    return status;
}

/*!
    \brief      get SENT channel global interrupt and flag status (API_ID: 0x0021U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus sent_channel_global_interrupt_flag_get(sent_channel_enum channelx)
{
    FlagStatus  status;
    uint32_t reg;

    /* get global interrupt and flag status */
    reg = SENT_GINTF & BIT((uint32_t)channelx);

    if(0U != reg) {
        status = SET;
    } else {
        status = RESET;
    }

    return status;
}

/*!
    \brief      clear SENT channel interrupt flag (API_ID: 0x0022U)
    \param[in]  channelx: SENT channel x (x = 0...5)
                only one parameter can be selected which is shown as below:
      \arg        SENT_CH0: SENT channel 0
      \arg        SENT_CH1: SENT channel 1
      \arg        SENT_CH2: SENT channel 2
      \arg        SENT_CH3: SENT channel 3
      \arg        SENT_CH4: SENT channel 4
      \arg        SENT_CH5: SENT channel 5
    \param[in]  int_flag: interrupt and flag type
                only one parameter can be selected which is shown as below:
      \arg        SENT_INT_FLAG_RSF     : receive success interrupt flag
      \arg        SENT_INT_FLAG_RBNE    : receive buffer not empty interrupt flag
      \arg        SENT_INT_FLAG_RXOVERR : receive buffer overflow error interrupt flag
      \arg        SENT_INT_FLAG_FDEVERR : frequency deviation error interrupt flag
      \arg        SENT_INT_FLAG_FDERR   : frequency drift error interrupt flag
      \arg        SENT_INT_FLAG_NNIBERR : number of nibbles error interrupt flag
      \arg        SENT_INT_FLAG_NIBVERR : nibble value error interrupt flag
      \arg        SENT_INT_FLAG_CRCERR  : CRC error interrupt flag
      \arg        SENT_INT_FLAG_SSDSTERR: short serial data message start bit error interrupt flag
      \arg        SENT_INT_FLAG_SDRBNE  : serial data receive buffer not empty interrupt flag
      \arg        SENT_INT_FLAG_SDCRCERR: serial data CRC error interrupt flag
      \arg        SENT_INT_FLAG_WDERR   : watchdog error interrupt flag
    \param[out] none
    \retval     none
*/
void sent_channel_interrupt_flag_clear(sent_channel_enum channelx, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SENT_INT_FLAG(int_flag)) {
        fw_debug_report_err(SENT_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SENT_CHSTATC((uint32_t)channelx) |= int_flag;
    }
}

/*!
    \brief      get SENT module clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
static double sent_get_module_clock(void)
{
    uint32_t fsys;
    uint32_t stepvalue = GET_BITS(SENT_FDIV, 0U, 9U);
    uint32_t dividermode = GET_BITS(SENT_FDIV, 14U, 15U);
    double   fracdiv = 0.0f;

    /* get SENT clock */
    fsys = rcu_clock_freq_get(CK_APB1);
    
    if (SENT_CLOCKDIVIDERMODE_NORMAL == dividermode) {
        fracdiv = (double)fsys / (1024.0f - (double)stepvalue);
    } else if (SENT_CLOCKDIVIDERMODE_FRACTIONAL == dividermode) {
        fracdiv = ((double)fsys * (double)stepvalue) / 1024.0f;
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }

    return fracdiv;
}

/*!
    \brief      get SENT channel clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
static double sent_get_channel_clock(sent_channel_enum channelx)
{
    double fracdiv;
    uint32_t psc = GET_BITS(SENT_CHPSC((uint32_t)channelx), 0U, 11U);
    double   fpsc;

    /* get fracdiv */
    fracdiv = sent_get_module_clock();
    /* get fpsc */
    fpsc = fracdiv / (double)(psc + 0x00000001U);

    return fpsc;
}
